blog/common/models/User.php

SELECT * FROM `user` WHERE (`id`=5) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`username`='admin') AND (`role`=1)
UPDATE `user` SET `updated_at`=1432182747, `ip_addr`='127.0.0.1', `login_time`=1432182746 WHERE `id`=8
---
    public static function findByUsername($username,$role)
    {
       $usermodel = static::findOne(['username' => $username,'role'=>$role]);
	   if($usermodel){
	   		$usermodel->ip_addr = Yii::$app->request->userIP;
	   		$usermodel->login_time = time();
			$usermodel->save();