blog/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `role`, `login_time`, `ip_addr`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('dedecms', 'dedecms@qq.com', 0, 1432182793, '127.0.0.1', '$2y$13$W2Ta/FTewheET0sp9YzcAeeISBLZqBixtm04fa.vj6do/4dzX.6R.', 'eLzpqPl_F6nF6Y3H0nYhEN_ruEunTfcb', 1, 1432182794, 1432182794)
---
    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->username = $this->username;
            $user->email = $this->email;
			$user->role = 0;//0表示前台用户
			$user->login_time = time();
			$user->ip_addr = Yii::$app->request->userIP;
            $user->setPassword($this->password);
            $user->generateAuthKey();
            if ($user->save()) {